content/temp/grid_tkinter.html
<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Grid Tkinter</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/personal/src/personalStyle.css"/>
<link rel="stylesheet" href="../theme/personal/src/highlight/styles/monokai-sublime.min.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Grid Tkinter</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#grid">Utiliser la méthode grid pour l'interface du Puissance 4</a>
<ul>
<li><a href="#ressources">Ressources</a></li>
<li><a href="#pourquoi-grid">Pourquoi une Grid pour le Puissance 4 ?</a></li>
<li><a href="#etapes">Etape par étape</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-grid" class="outline-2">
<h2 id="grid">Utiliser la méthode grid pour l'interface du Puissance 4</h2>
<div class="outline-text-2" id="text-grid">
</div>

<div id="outline-container-ressources" class="outline-3">
<h3 id="ressources">Ressources</h3>
<div class="outline-text-3" id="text-ressources">
<p target="_blank">
<a href="https://koor.fr/Python/Tutoriel_Tkinter/tkinter_layout_grid.wp" target="_blank">https://koor.fr/Python/Tutoriel_Tkinter/tkinter_layout_grid.wp</a>
</p>
</div>
</div>

<div id="outline-container-pourquoi-grid" class="outline-3">
<h3 id="pourquoi-grid">Pourquoi une Grid pour le Puissance 4 ?</h3>
<div class="outline-text-3" id="text-pourquoi-grid">
<p>
La méthode grid sert à positionner des éléments (=widgets) dans notre écran en fonction d'un positionnement matriciel. Comme nous utilisons une matrice, c'est à dire une liste de listes, pour placer nos jetons sur le plateau, c'est la méthode la plus adaptée. Il faudra associer à chaque cellule créée le clic de la souris et la fonction qui placera le jeton.
</p>
</div>
</div>

<div id="outline-container-etapes" class="outline-3">
<h3 id="etapes">Etape par étape</h3>
<div class="outline-text-3" id="text-etapes">
</div>
<div id="outline-container-org779d799" class="outline-4">
<h4 id="org779d799">Pré-requis</h4>
<div class="outline-text-4" id="text-org779d799">
<p>
Il faut déjà avoir initialisé ta grille de puissance 4 avant de paramétrer l'affichage car tu auras besoin de la taille de la grille et des éventuelles valeurs des cases.
</p>
</div>
</div>

<div id="outline-container-orgcd1e44f" class="outline-4">
<h4 id="orgcd1e44f">Initialisation</h4>
<div class="outline-text-4" id="text-orgcd1e44f">
<ol class="org-ol">
<li>Crée un objet Tk() (<code>window = tkinter.Tk()</code>).</li>
<li>Configure la fenêtre (titre, fond, etc).</li>
<li>Crée un dictionnaire vide qui contiendra tous les widgets de la grille (<code>widgets = {}</code>).</li>
</ol>
</div>
</div>

<div id="outline-container-orgd9c422f" class="outline-4">
<h4 id="orgd9c422f">Création des widgets</h4>
<div class="outline-text-4" id="text-orgd9c422f">
<ol class="org-ol">
<li><p>
A l'aide d'une double boucle imbriquée (pour parcourir la grille de puissance 4), il faut pour chaque case de la grille créer une cellule pour ton affichage (une cellule sera un Label()). Exemple à l'intérieur de la boucle:
</p>
<div class="org-src-container">
<pre class="src src-python">cell = Label(window, text=" ", bg='white')
cell.grid(row = i, column = j)
cell.bind('&lt;Button-1&gt;', clic)
# clic correspond à une fonction qui faudra définir et qui sera lancée uniquement lorsque l'on clique sur une cellule.
widgets[(i,j)] = cell
# utiliser le (i,j) comme clé permettra de retrouver le widget correspondant à une case de la grille de puissance 4.
</pre>
</div></li>

<li><p>
La fonction clic doit récupérer l'information de la colonne sélectionnée et lancer la fonction qui trouve la bonne ligne pour placer le jeton. Exemple de début de la fonction :
</p>
<div class="org-src-container">
<pre class="src src-python">def clic(event):
    cell = event.widget
    col = int(cell.grid_info()['column'])
    ligne = trouver_ligne(col)
    # Le reste à implémenter
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
